douggilliland/Retro-Computers/Z80/PSOC/PSOC_Design_Files/FrontPanelI2CIO8/USBFS_UART01.cydsn/codegentemp/cy_em_eeprom.c
/***************************************************************************//**
* \file cy_em_eeprom.c
* \version 2.20
*
* \brief
*  This file provides source code of the API for the Emulated EEPROM library.
*  The Emulated EEPROM API allows creating of an emulated EEPROM in flash that
*  has the ability to do wear leveling and restore corrupted data from a
*  redundant copy.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include "cytypes.h"
#include <string.h>

#if (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC6)
    #include "em_eeprom/cy_em_eeprom.h"
#else
    #include "cy_em_eeprom.h"
#endif /* (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC6) */


#if defined(__cplusplus)
extern "C" {
#endif


/***************************************
* Private Function Prototypes
***************************************/
static void FindLastWrittenRow(uint32 * lastWrRowPtr, cy_stc_eeprom_context_t * context);
static uint32 GetRowAddrBySeqNum(uint32 seqNum, cy_stc_eeprom_context_t * context);
static uint8 CalcChecksum(uint8 rowData[], uint32 len);
static void GetNextRowToWrite(uint32 seqNum,
                            uint32 * rowToWrPtr,
                            uint32 * rowToRdPtr,
                            cy_stc_eeprom_context_t * context);
static cy_en_em_eeprom_status_t CheckRanges(cy_stc_eeprom_config_t* config);
static cy_en_em_eeprom_status_t WriteRow(uint32 rowAddr, uint32 *rowData, cy_stc_eeprom_context_t * context);
static cy_en_em_eeprom_status_t EraseRow(uint32 rowAddr, uint32 ramBuffAddr, cy_stc_eeprom_context_t * context);
static cy_en_em_eeprom_status_t CheckCrcAndCopy(uint32 startAddr,
                                                uint32 dstAddr,
                                                uint32 rowOffset,
                                                uint32 numBytes,
                                                cy_stc_eeprom_context_t * context);
static uint32 GetAddresses(uint32 *startAddr, uint32 *endAddr, uint32 *offset, uint32 rowNum, uint32 addr, uint32 len);
static cy_en_em_eeprom_status_t FillChecksum(cy_stc_eeprom_context_t * context);

/**
* \addtogroup group_em_eeprom_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_Em_EEPROM_Init
****************************************************************************//**
*
* Initializes the Emulated EEPROM library by filling the context structure. 
*
* \param config
* The pointer to a configuration structure. See \ref cy_stc_eeprom_config_t.
*
* \param context
* The pointer to the EEPROM context structure to be filled by the function.
* \ref cy_stc_eeprom_context_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
* \note
* The context structure should not be modified by the user after it is filled
* with this function. Modification of context structure may cause the 
* unexpected behavior of the Cy_Em_EEPROM API functions which rely on it.
*
* \note
* This function uses a buffer of the flash row size to perform read
* operation. For the size of the row refer to the specific PSoC device
* datasheet.
*
* \sideeffect 
* If the "Redundant Copy" option is used, the function performs a number of 
* write operations to the EEPROM to initialize flash rows checksums. Therefore,
* Cy_Em_EEPROM_NumWrites(), when it is called right after Cy_Em_EEPROM_Init(), 
* will return a non-zero value that identifies the number of writes performed 
* by Cy_Em_EEPROM_Init().
*
*******************************************************************************/
cy_en_em_eeprom_status_t Cy_Em_EEPROM_Init(cy_stc_eeprom_config_t* config, cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_PARAM;

    if((NULL != context) && (NULL != config) && (NULL != ((uint32 *)config->userFlashStartAddr)) &&
        (config->wearLevelingFactor <= CY_EM_EEPROM_MAX_WEAR_LEVELING_FACTOR) && (config->eepromSize != 0u))
    {
        ret = CheckRanges(config);

        if(CY_EM_EEPROM_SUCCESS == ret)
        {
            /* Copy the user config structure fields into context */
            context->eepromSize = config->eepromSize;
            context->wearLevelingFactor = config->wearLevelingFactor;
            context->redundantCopy = config->redundantCopy;
            context->blockingWrite = config->blockingWrite;
            context->userFlashStartAddr = config->userFlashStartAddr;
            /* Store frequently used data for internal use */
            context->numberOfRows = CY_EM_EEPROM_GET_NUM_ROWS_IN_EEPROM(config->eepromSize);
            context->wlEndAddr = ((CY_EM_EEPROM_GET_EEPROM_SIZE(context->numberOfRows) * config->wearLevelingFactor) +
                    config->userFlashStartAddr);
            /* Find last written EEPROM row and store it for quick access */
            FindLastWrittenRow(&context->lastWrRowAddr, context);

            if((0u == CY_EM_EEPROM_GET_SEQ_NUM(context->lastWrRowAddr)) && (0u != context->redundantCopy))
            {
                /* Call the function only after device reprogramming in case
                * if redundant copy is enabled.
                */
                ret = FillChecksum(context);
                
                /* Update the last written EEPROM row for Cy_Em_EEPROM_NumWrites() */
                FindLastWrittenRow(&context->lastWrRowAddr, context);
            }
        }
    }

    return(ret);
}


/*******************************************************************************
* Function Name: Cy_Em_EEPROM_Read
****************************************************************************//**
*
* This function takes the logical EEPROM address, converts it to the actual
* physical address where the data is stored and returns the data to the user.
*
* \param addr
* The logical start address in EEPROM to start reading data from.
*
* \param eepromData
* The pointer to a user array to write data to.
*
* \param size
* The amount of data to read.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* This function returns \ref cy_en_em_eeprom_status_t.
*
* \note
* This function uses a buffer of the flash row size to perform read
* operation. For the size of the row refer to the specific PSoC device
* datasheet.
*
* \note
* In case if redundant copy option is enabled the function may perform writes
* to EEPROM. This is done in case if the data in the EEPPROM is corrupted and
* the data in redundant copy is valid based on CRC-8 data integrity check.
*
*******************************************************************************/
cy_en_em_eeprom_status_t Cy_Em_EEPROM_Read(uint32 addr, 
                                        void * eepromData, 
                                        uint32 size,
                                        cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_PARAM;
    uint32 i;
    uint32 numBytesToRead;
    uint32 curEepromBaseAddr;
    uint32 curRowOffset;
    uint32 startRowAddr;
    uint32 actEepromRowNum;
    uint32 curRdEepromRowNum = 0u;
    uint32 dataStartEepromRowNum = 0u;
    uint32 eeData = (uint32) eepromData; /* To avoid the pointer arithmetic with void */

    /* Validate input parameters */
    if((0u != size) && ((addr + size) <= (context->eepromSize)) && (NULL != eepromData))
    {
        uint32 rdAddr = addr;
        uint32 rdSize = size;
        /* Get the sequence number of the last written row */
        uint32 seqNum = CY_EM_EEPROM_GET_SEQ_NUM(context->lastWrRowAddr);
        uint32 updateAddrFlag = 0u;

