douggilliland/Retro-Computers/Z80/PSOC/PSOC_Design_Files/FrontPanelI2CIO8/USBFS_UART01.cydsn/codegentemp/cy_em_eeprom.c
        /* Calculate the number of the row read operations. Currently this only concerns
        * the reads from the EEPROM data locations.
        */
        uint32 numRowReads = ((((rdAddr + rdSize) - 1u) / CY_EM_EEPROM_EEPROM_DATA_LEN) -
                              (rdAddr / CY_EM_EEPROM_EEPROM_DATA_LEN)) + 1u;

        /* Get the address of the first row of the currently active EEPROM sector. If
        * no wear leveling is used - the EEPROM has only one sector, so use the base
        * addr stored in "context->userFlashStartAddr".
        */
        curEepromBaseAddr = (((context->lastWrRowAddr - context->userFlashStartAddr) /
                              (CY_EM_EEPROM_FLASH_SIZEOF_ROW * context->numberOfRows)) *
                              (CY_EM_EEPROM_FLASH_SIZEOF_ROW * context->numberOfRows)) +
                               context->userFlashStartAddr;

        /* Find the number of the row that contains the start address of the data */
        for(i = 0u; i < context->numberOfRows; i++)
        {
            if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(rdAddr, i))
            {
                dataStartEepromRowNum = i;
                curRdEepromRowNum = dataStartEepromRowNum;
                break;
            }
        }

        /* Find the row number of the last written row */
        actEepromRowNum = (context->lastWrRowAddr - curEepromBaseAddr) / CY_EM_EEPROM_FLASH_SIZEOF_ROW;

        /* Check if wear leveling is used */
        if(context->wearLevelingFactor > 1u)
        {
            uint32 dataEndEepromRowNum = dataStartEepromRowNum + (numRowReads - 1u);

            /* Check if the future validation of the read address is required. */
            updateAddrFlag = (dataStartEepromRowNum > actEepromRowNum) ? 1u :
                              ((dataEndEepromRowNum > actEepromRowNum) ? 1u : 0u);
        }

        /* Copy data from the EEPROM data locations to the user buffer */
        for(i = 0u; i < numRowReads; i++)
        {
            startRowAddr = curEepromBaseAddr + (curRdEepromRowNum * CY_EM_EEPROM_FLASH_SIZEOF_ROW);
            curRowOffset = CY_EM_EEPROM_EEPROM_DATA_LEN + (rdAddr % CY_EM_EEPROM_EEPROM_DATA_LEN);

            /* Check if there are more reads pending and update the number of the
            * remaining bytes to read respectively.
            */
            if((i + 1u) < numRowReads)
            {
                numBytesToRead = CY_EM_EEPROM_EEPROM_DATA_LEN - (rdAddr % CY_EM_EEPROM_EEPROM_DATA_LEN);
            }
            else
            {
                numBytesToRead = rdSize;
            }

            /* Check if the read address needs to be updated to point to the correct
            * EEPROM sector.
            */
            if((0u != updateAddrFlag) && (curRdEepromRowNum > actEepromRowNum))
            {
                startRowAddr -= context->numberOfRows * CY_EM_EEPROM_FLASH_SIZEOF_ROW;

                if(startRowAddr < context->userFlashStartAddr)
                {
                    startRowAddr = context->wlEndAddr -
                        ((context->numberOfRows - curRdEepromRowNum) * CY_EM_EEPROM_FLASH_SIZEOF_ROW);
                }
            }

            if(0u != context->redundantCopy)
            {
                /* Check a checksum of the EEPROM row and if it is bad, check a checksum in
                * the corresponding row in redundant copy, otherwise return failure.
                */
                ret = CheckCrcAndCopy(startRowAddr, eeData, curRowOffset, numBytesToRead, context);

                if(CY_EM_EEPROM_SUCCESS != ret)
                {
                    break;
                }
            }
            else
            {
                /* Copy the data to the user buffer */
                (void)memcpy((void *)(eeData),
                             (void *)(startRowAddr + curRowOffset),
                             numBytesToRead);

                /* Indicate success to be able to execute next code block */
                ret = CY_EM_EEPROM_SUCCESS;
            }

            /* Update variables anticipated in the read operation */
            rdAddr += numBytesToRead;
            rdSize -= numBytesToRead;
            eeData += numBytesToRead;
            curRdEepromRowNum++;
        }

        /* This code block will copy the latest data from the EEPROM headers into the
        * user buffer. The data previously copied into the user buffer may be updated
        * as the EEPROM headers contain more recent data. 
        * The code block is executed when two following conditions are true:
        *  1) The reads from "historic" data locations were successful;
        *  2) The user performed at least one write operation to Em_EEPROM (0u !=
        *     seqNum).        
        */
        if((CY_EM_EEPROM_SUCCESS == ret) && (0u != seqNum))
        {
            numRowReads = (context->numberOfRows <= seqNum) ? (context->numberOfRows) : (seqNum);
            numRowReads--;

            for(i = (seqNum - numRowReads); i <= seqNum; i++)
            {
                startRowAddr = GetRowAddrBySeqNum(i, context);

                if (0u != startRowAddr)
                {
                    /* The following variables are introduced to increase code readability. */
                    uint32 startAddr  = *(uint32 *)(startRowAddr + CY_EM_EEPROM_HEADER_ADDR_OFFSET);
                    uint32 endAddr    = startAddr + (*(uint32 *)(startRowAddr + CY_EM_EEPROM_HEADER_LEN_OFFSET));

                    /* Check if the current row EEPROM header contains the data requested for read */
                    if(0u != CY_EM_EEPROM_IS_ADDRESES_CROSSING(startAddr, endAddr, addr, addr + size))
                    {
                        uint32 srcOffset = (startAddr > addr) ? (0u) : (addr - startAddr);
                        uint32 dstOffset = (startAddr > addr) ? (startAddr - addr): (0u);
                        rdAddr = (startAddr > addr) ? (startAddr) : (addr);

                        srcOffset += CY_EM_EEPROM_HEADER_DATA_OFFSET;

