douggilliland/Retro-Computers/Z80/PSOC/PSOC_Design_Files/FrontPanelI2CIO8/USBFS_UART01.cydsn/codegentemp/cy_em_eeprom.c
            if(emEepromRowRdAddr != 0UL)
            {
                /* Copy the EEPROM historic data for this row from flash to RAM */
                (void)memcpy((void *)&writeRamBuffer[CY_EM_EEPROM_EEPROM_DATA_OFFSET_U32],
                             (void *)(emEepromRowRdAddr + CY_EM_EEPROM_EEPROM_DATA_LEN),
                             CY_EM_EEPROM_EEPROM_DATA_LEN);
            }

            /* Check if there is data for this location in other EEPROM headers:
            * find out the row with the lowest possible sequence number which
            * may contain the data for the current row.
            */
            i = (seqNum > context->numberOfRows) ? ((seqNum - (context->numberOfRows)) + 1u) : 1u;

            for(; i <= seqNum; i++)
            {
                if(i == seqNum)
                {
                    /* The code reached the row that is about to be written. Analyze the recently
                    * created EEPROM header (stored in the RAM buffer currently): if it contains
                    * the data for EEPROM data locations in the row that is about to be written.
                    */
                    tmpRowAddr = (uint32) writeRamBuffer;
                }
                else
                {
                    /* Retrieve the address of the previously written row by its sequence number.
                    * The pointer will be used to get data from the respective EEPROM header.
                    */
                    tmpRowAddr = GetRowAddrBySeqNum(i, context);
                }

                actEmEepromRowNum = CY_EM_EEPROM_GET_ACT_ROW_NUM_FROM_ADDR(emEepromRowAddr,
                                                                           context->numberOfRows,
                                                                           context->userFlashStartAddr);
                if(0UL != tmpRowAddr)
                {
                    /* Calculate the required addressed for the later EEPROM historic data update */
                    skipOperation = GetAddresses(
                                              &startAddr,
                                              &endAddr,
                                              &eeHeaderDataOffset,
                                              actEmEepromRowNum,
                                              *(uint32 *)(tmpRowAddr + CY_EM_EEPROM_HEADER_ADDR_OFFSET),
                                              *(uint32 *)(tmpRowAddr + CY_EM_EEPROM_HEADER_LEN_OFFSET));
                }
                else
                {
                    /* Skip writes to the RAM buffer */
                    skipOperation++;
                }

                /* Write data to the RAM buffer */
                if(0u == skipOperation)
                {
                    uint32 dataAddr = ((uint32)((uint8 *)&writeRamBuffer)) + startAddr;

                    /* Update the address to point to the EEPROM header data and not to
                    * the start of the row.
                    */
                    tmpRowAddr = tmpRowAddr + CY_EM_EEPROM_HEADER_DATA_OFFSET + eeHeaderDataOffset;
                    (void)memcpy((void *)(dataAddr), (void *)(tmpRowAddr), endAddr - startAddr);
                }

                /* Calculate the checksum if redundant copy is enabled */
                if(0u != context->redundantCopy)
                {
                    writeRamBuffer[CY_EM_EEPROM_HEADER_CHECKSUM_OFFSET_U32] = (uint32)
                        CalcChecksum((uint8 *) &writeRamBuffer[CY_EM_EEPROM_EEPROM_DATA_OFFSET_U32],
                                                  CY_EM_EEPROM_EEPROM_DATA_LEN);
                }
            }

            /* Write the data to the specified flash row */
            ret = WriteRow(emEepromRowAddr, writeRamBuffer, context);
            tmpRowAddr = emEepromRowAddr;

            /* Check if redundant copy is used */
            if((0u != context->redundantCopy) && (CY_EM_EEPROM_SUCCESS == ret))
            {
                /* Update the row address to point to the row in the redundant EEPROM's copy */
                tmpRowAddr = (emEepromRowAddr - context->userFlashStartAddr) + context->wlEndAddr;

                /* Write the data to the specified flash row */
                ret = WriteRow(tmpRowAddr, writeRamBuffer, context);
            }

            if(CY_EM_EEPROM_SUCCESS == ret)
            {
                /* Store last written row address only when EEPROM and redundant
                * copy writes were successful.
                */
                context->lastWrRowAddr = emEepromRowAddr;
            }
            else
            {
                break;
            }
        }
    }
    return(ret);
}


/*******************************************************************************
* Function Name: Cy_Em_EEPROM_Erase
****************************************************************************//**
*
* This function erases the entire contents of the EEPROM. Erased values are all
* zeros. This is a blocking function and it does not return until the write
* operation is completed. The user firmware should not enter Hibernate mode until
* erase is completed. The erase operation is allowed in Sleep and Deep-Sleep modes.
* During the flash operation, the device should not be reset, including the
* XRES pin, a software reset, and watchdog reset sources. Also, low-voltage
* detect circuits should be configured to generate an interrupt instead of a
* reset. Otherwise, portions of flash may undergo unexpected changes.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* This function returns \ref cy_en_em_eeprom_status_t.
*
* \note
* For all non PSoC 6 devices the erase operation is performed by clearing
* the EEPROM data using flash write. This affects the flash durability.
* So it is recommended to use this function in utmost case to prolongate
* flash life.
*
* \note
* This function uses a buffer of the flash row size to perform erase
* operation. For the size of the row refer to the specific PSoC device
* datasheet.
*
* \sideeffect
* In case when blocking write option is used, if this function is called by
* the CM4 the user code on CM0P and the user code on CM4 are blocked until erase
* flash row operation is finished. If this function is called by the CM0P the
* user code on CM4 is not blocked and the user code on CM0P is blocked until
* erase flash row operation is finished. Plan your task allocation accordingly.
*
* \sideeffect
* In case if non-blocking write option is used and when user flash is used as
* an EEPROM storage care should be taken to prevent the read while write (RWW)
* exception. To prevent the RWW exception the user flash macro that includes
* the EEPROM storage should not be read while the EEPROM erase is not completed.
* The read also means the user code execution from the respective flash macro.
*
*******************************************************************************/
cy_en_em_eeprom_status_t Cy_Em_EEPROM_Erase(cy_stc_eeprom_context_t * context)
{
    uint32 i;
    uint32 seqNum;
    uint32 emEepromRowAddr = context->lastWrRowAddr;
    uint32 emEepromRowRdAddr;
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_WRITE_FAIL;
    uint32 writeRamBuffer[CY_EM_EEPROM_FLASH_SIZEOF_ROW / CY_EM_EEPROM_U32_DIV] = {0u};
#if (CY_PSOC6)
    uint32 emEepromStoredRowAddr = context->lastWrRowAddr;
    uint32 storedSeqNum;
#endif /* (!CY_PSOC6) */

    /* Get the sequence number of the last written row */
    seqNum = CY_EM_EEPROM_GET_SEQ_NUM(emEepromRowAddr);

    /* If there were no writes to EEPROM - nothing to erase */
    if(0u != seqNum)
    {
        /* Calculate the number of row erase operations required */
        uint32 numWrites = context->numberOfRows * context->wearLevelingFactor;

    #if (CY_PSOC6)
        GetNextRowToWrite(seqNum, &emEepromStoredRowAddr, &emEepromRowRdAddr, context);
        storedSeqNum = seqNum + 1u;
    #endif /* (CY_PSOC6) */

        if(0u != context->redundantCopy)
        {
            writeRamBuffer[CY_EM_EEPROM_HEADER_CHECKSUM_OFFSET_U32] = (uint32)
                        CalcChecksum((uint8 *) &writeRamBuffer[CY_EM_EEPROM_EEPROM_DATA_OFFSET_U32],
                                                  CY_EM_EEPROM_EEPROM_DATA_LEN);
        }

