douggilliland/Retro-Computers/Z80/PSOC/PSOC_Design_Files/FrontPanelI2CIO8/USBFS_UART01.cydsn/codegentemp/cy_em_eeprom.c
        for(i = 0u; i < numWrites; i++)
        {
        #if (CY_PSOC6)
            /* For PSoC 6 the erase operation moves backwards. From last written row
            * identified by "seqNum" down to "seqNum" - "numWrites". If "emEepromRowAddr"
            * is zero this means that the row identified by "seqNum" was previously 
            * erased.
            */
            if(0u != emEepromRowAddr)
            {
                ret = EraseRow(emEepromRowAddr, (uint32)writeRamBuffer, context);
            }

            seqNum--;

            if(0u == seqNum)
            {
                /* Exit the loop as there is no more row is EEPROM to be erased */
                break;
            }
            emEepromRowAddr = GetRowAddrBySeqNum(seqNum, context);
        #else
            seqNum = CY_EM_EEPROM_GET_SEQ_NUM(emEepromRowAddr);
            /* Get the address of the row to be erased. "emEepromRowAddr" may be updated
            * with the proper address (if wear leveling is used).
            */
            GetNextRowToWrite(seqNum, &emEepromRowAddr, &emEepromRowRdAddr, context);
            seqNum++;
            writeRamBuffer[0u] = seqNum;
            ret = EraseRow(emEepromRowAddr, (uint32)writeRamBuffer, context);
        #endif /* (CY_PSOC6) */
        }

    #if (CY_PSOC6)
        if(CY_EM_EEPROM_SUCCESS == ret)
        {
            writeRamBuffer[0u] = storedSeqNum;

            /* Write the previously stored sequence number to the flash row which would be
            * written next if the erase wouldn't happen. In this case the write to
            * redundant copy can be skipped as it does not add any value.
            */
            ret = WriteRow(emEepromStoredRowAddr, writeRamBuffer, context);

            if(CY_EM_EEPROM_SUCCESS == ret)
            {
                context->lastWrRowAddr = emEepromStoredRowAddr;
            }
        }
    #endif /* (CY_PSOC6) */

    }
    return(ret);
}


/*******************************************************************************
* Function Name: Cy_Em_EEPROM_NumWrites
****************************************************************************//**
*
* Returns the number of the EEPROM writes completed so far.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* The number of writes performed to the EEPROM.
*
*******************************************************************************/
uint32 Cy_Em_EEPROM_NumWrites(cy_stc_eeprom_context_t * context)
{
    return(CY_EM_EEPROM_GET_SEQ_NUM(context->lastWrRowAddr));
}

/** \} */

/** \cond INTERNAL */


/*******************************************************************************
* Function Name: FindLastWrittenRow
****************************************************************************//**
*
* Performs a search of the last written row address of the EEPROM associated
* with the context structure. If there were no writes to the EEPROM the
* function returns the start address of the EEPROM. The row address is returned
* in the input parameter.
*
* \param lastWrRowPtr
* The pointer to a memory where the last written row will be returned.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
*******************************************************************************/
static void FindLastWrittenRow(uint32 * lastWrRowPtr, cy_stc_eeprom_context_t * context)
{
    uint32 seqNum = 0u;
    uint32 prevSeqNum = 0u;
    uint32 numRows;
    uint32 emEepromAddr = context->userFlashStartAddr;

    *lastWrRowPtr = emEepromAddr;

    for(numRows = 0u; numRows < (context->numberOfRows * context->wearLevelingFactor); numRows++)
    {
        seqNum = CY_EM_EEPROM_GET_SEQ_NUM(emEepromAddr);
        if((0u != seqNum) && (seqNum > prevSeqNum))
        {
            /* Some record in EEPROM was found. Store found sequence
            * number and row address.
            */
            prevSeqNum = seqNum;
            *lastWrRowPtr = emEepromAddr;
        }

        /* Switch to the next row */
        emEepromAddr = emEepromAddr + CY_EM_EEPROM_FLASH_SIZEOF_ROW;
    }
}


/*******************************************************************************
* Function Name: GetRowAddrBySeqNum
****************************************************************************//**
*
* Returns the address of the row in EEPROM using its sequence number.
*
* \param seqNum
* The sequence number of the row.
*
* \param context
* The pointer to the EEPROM context structure.
*
* \return
* The address of the row or zero if the row with the sequence number was not
* found.
*
*******************************************************************************/
static uint32 GetRowAddrBySeqNum(uint32 seqNum, cy_stc_eeprom_context_t * context)
{
    uint32 emEepromAddr = context->userFlashStartAddr;

    while(CY_EM_EEPROM_GET_SEQ_NUM(emEepromAddr) != seqNum)
    {
        /* Switch to the next row */
        emEepromAddr = emEepromAddr + CY_EM_EEPROM_FLASH_SIZEOF_ROW;

        if (CY_EM_EEPROM_ADDR_IN_RANGE !=
            CY_EM_EEPROM_IS_ADDR_EXCEED_RANGE(emEepromAddr, context->wlEndAddr))
        {
            emEepromAddr = 0u;
            /* Exit the loop as we reached the end of EEPROM */
            break;
        }
    }

    return (emEepromAddr);
}


/*******************************************************************************
* Function Name: GetNextRowToWrite
****************************************************************************//**
*
* Performs a range check of the row that should be written and updates the
* address to the row respectively. The similar actions are done for the read
* address.
*
* \param seqNum
* The sequence number of the last written row.
*
* \param rowToWrPtr
* The address of the last written row (input). The address of the row to be 
* written (output).
*
* \param rowToRdPtr
* The address of the row from which the data should be read into the RAM buffer
* in a later write operation. Out parameter.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
*******************************************************************************/
static void GetNextRowToWrite(uint32 seqNum,
                            uint32 * rowToWrPtr,
                            uint32 * rowToRdPtr,
                            cy_stc_eeprom_context_t * context)
{
    /* Switch to the next row to be written if the current sequence number is
    * not zero.
    */
    if(0u != seqNum)
    {
        *rowToWrPtr = (*rowToWrPtr + CY_EM_EEPROM_FLASH_SIZEOF_ROW);
    }

    /* If the resulting row address is out of EEPROM, then switch to the base
    * EEPROM address (Row#0).
    */
    if(CY_EM_EEPROM_ADDR_IN_RANGE !=
            CY_EM_EEPROM_IS_ADDR_EXCEED_RANGE(*rowToWrPtr, context->wlEndAddr))
    {
        *rowToWrPtr = context->userFlashStartAddr;
    }

